Repository: kchaouamira0/IITG_Project-
Catalog: translations/messages.*.xlf
Languages: fr

source: International Institute Of Technology And Management IITG
fr: Institut International de Technologie et de Gestion IITG

source: News
fr: Actualités

source: Our news
fr: Nos nouvelles

source: Home
fr: Accueil

source: Key Figures
fr: Chiffres Clés

source: IITG Key Figures
fr: Chiffres Clés de l'IITG

source: Graduates
fr: Diplômés

source: Teachers
fr: Enseignants

source: Departments
fr: Départements

source: Prof insertion
fr: Insertion prof

source: To Recieve Our Updates Via E-mail
fr: Pour recevoir nos mises à jour par E-mail

source: About us
fr: À propos de nous

source: The International Institute of Technology and Management (IITG) is a private institution of Higher Education. Founded in September 2022 by two partners, the institute is aligned with the guidelines of sub-regional university institutions, as well as national and international standards relating to Higher Education.
fr: L'IITG est un établissement privé d’Enseignement Supérieur. Fondé en septembre 2022 par des partenaires Gabonais et étrangers, l’institut s’arrime aux Directives des institutions sous régionales universitaires, ainsi qu’aux normes nationales et internationales relatives à l’Enseignement Supérieur.Il comprend un conseil de direction et un conseil académique issues de sa gouvernance académique.

source: LAST ARTICLES
fr: DERNIERS ARTICLES

source: LATEST TWEETS
fr: DERNIERS TWEETS

source: Contact Us
fr: Contactez-nous

source: Bp : 1989 Libreville-Gabon, Commune of Akanda (50 M from okala police station)
fr: Commune d’Akanda, 100 m du Commissariat d’OKALA (Pizzeria le MAYON)

source: Who are we?
fr: À propos

source: Missions
fr: Nos missions

source: Admission
fr: Admissions

source: Academic cooperation
fr: Coopération Académique

source: International Institute of Technology and Management
fr: Institut International de Technologie et de Gestion

source: IITG is committed to developing in learners educational and professional ethics, critical thinking, analytical and problem-solving skills, creativity, innovation and leadership.
fr: IITG se donne pour mission principale de contribuer au développement d’une société tournée essentiellement vers la Compétence et la Connaissance. Ainsi, les formations professionnelles et innovantes qu’il proposées visent à rendre les apprenants compétitifs, dans un univers de plus en plus globalisant

source: Learn more
fr: En savoir plus

source: apply now
fr: postulez maintenant

source: Partners
fr: Partenaires

source: Partners/Collaborators
fr: Nos Partenaires

source: Directions and services
fr: Directions et services
